results/PerconaServer/KabyLake/throughput/dyni-oltp_simple.log
sysbench 1.0.8 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            2810827
        write:                           0
        other:                           0
        total:                           2810827
    transactions:                        2810827 (46846.06 per sec.)
    queries:                             2810827 (46846.06 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0002s
    total number of events:              2810827

Latency (ms):
         min:                                  0.02
         avg:                                  0.02
         max:                                  2.50
         95th percentile:                      0.03
         sum:                              58680.40

Threads fairness:
    events (avg/stddev):           2810827.0000/0.00
    execution time (avg/stddev):   58.6804/0.00

sysbench 1.0.8 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 2
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            5024068
        write:                           0
        other:                           0
        total:                           5024068
    transactions:                        5024068 (83732.49 per sec.)
    queries:                             5024068 (83732.49 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0002s
    total number of events:              5024068

Latency (ms):
         min:                                  0.02
         avg:                                  0.02
         max:                                  2.70
         95th percentile:                      0.04
         sum:                             116777.57

Threads fairness:
    events (avg/stddev):           2512034.0000/100399.00
    execution time (avg/stddev):   58.3888/0.05

sysbench 1.0.8 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 4
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            9476036
        write:                           0
        other:                           0
        total:                           9476036
    transactions:                        9476036 (157930.14 per sec.)
    queries:                             9476036 (157930.14 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0002s
    total number of events:              9476036

Latency (ms):
         min:                                  0.02
         avg:                                  0.02
         max:                                  4.74
         95th percentile:                      0.04
         sum:                             232546.31

Threads fairness:
    events (avg/stddev):           2369009.0000/7903.09
    execution time (avg/stddev):   58.1366/0.01

sysbench 1.0.8 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 8
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            13206760
        write:                           0
        other:                           0
        total:                           13206760
    transactions:                        13206760 (220106.94 per sec.)
    queries:                             13206760 (220106.94 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0004s
    total number of events:              13206760

Latency (ms):
         min:                                  0.02
         avg:                                  0.04
         max:                                  6.79
         95th percentile:                      0.07
         sum:                             468732.23

Threads fairness:
    events (avg/stddev):           1650845.0000/4551.94
    execution time (avg/stddev):   58.5915/0.01

sysbench 1.0.8 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 16
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            14133845
        write:                           0
        other:                           0
        total:                           14133845
    transactions:                        14133845 (235556.09 per sec.)
    queries:                             14133845 (235556.09 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0008s
    total number of events:              14133845

Latency (ms):
         min:                                  0.02
         avg:                                  0.07
         max:                                  6.87
         95th percentile:                      0.12
         sum:                             948413.33

Threads fairness:
    events (avg/stddev):           883365.3125/4355.29
    execution time (avg/stddev):   59.2758/0.01

sysbench 1.0.8 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 32
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            14322753
        write:                           0
        other:                           0
        total:                           14322753
    transactions:                        14322753 (238701.06 per sec.)
    queries:                             14322753 (238701.06 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0017s
    total number of events:              14322753

Latency (ms):
         min:                                  0.02
         avg:                                  0.13
         max:                                 12.78
         95th percentile:                      0.21
         sum:                            1908989.81

Threads fairness:
    events (avg/stddev):           447586.0312/3100.28
    execution time (avg/stddev):   59.6559/0.00

sysbench 1.0.8 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 64
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            13724127
        write:                           0
        other:                           0
        total:                           13724127
    transactions:                        13724127 (228717.76 per sec.)
    queries:                             13724127 (228717.76 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0034s
    total number of events:              13724127

Latency (ms):
         min:                                  0.02
         avg:                                  0.28
         max:                                 15.67
         95th percentile:                      0.39
         sum:                            3828492.01

Threads fairness:
    events (avg/stddev):           214439.4844/699.09
    execution time (avg/stddev):   59.8202/0.01

sysbench 1.0.8 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 128
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            10945399
        write:                           0
        other:                           0
        total:                           10945399
    transactions:                        10945399 (182397.44 per sec.)
    queries:                             10945399 (182397.44 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0073s
    total number of events:              10945399

Latency (ms):
         min:                                  0.03
         avg:                                  0.70
         max:                                 43.76
         95th percentile:                      0.90
         sum:                            7665424.59

Threads fairness:
    events (avg/stddev):           85510.9297/331.15
    execution time (avg/stddev):   59.8861/0.01